' ***********************************************************************
' * CLOOS 机器人参数定义
' ***********************************************************************
'基座的垂直高度
dim LargeZ = 422
'1 轴到 2 轴的 X 偏移；转盘中心到大摆臂中心的偏移
dim L1 = 193.539
'大摆臂长度
dim L2 = 800.928
'3 轴中心到 4 轴中心距离
dim L3 = 174.472
'4 轴到 5 轴的距离。
dim L4 = 1000.5
'5 转一圈，6 转动的圈数，0 表示不关联
dim D5 = 0
'末端到 5 轴的垂直距离
dim SmalLZ = 112 +669.191
'末端到转盘中心的 XY 偏移。 0 位置的时候
dim SmalLX = 0 + 5.347
dim SmalLY = -0.2564 - 2.061
'虚拟姿态轴一圈脉冲数
dim PulesVROneCircle = 360*1000
'初始的姿态，弧度单位。 0，0，0 指向 z 正向
dim InitRx = 0, InitRy = 28.890/180*pi, InitRz = 0
' ***********************************************************************
' * 电机参数
' ***********************************************************************
' 电机圈脉冲数
dim u_m1 = 10000, u_m2 = 10000, u_m3 = 10000, u_m4 = 10000, u_m5 = 10000, u_m6 = 10000
' 关节传动比
dim i_1 = 1, i_2 = 1, i_3 = 1, i_4 = 1, i_5 = 1, i_6 = 1
' 关节实际一圈脉冲数
dim u_j1 = u_m1*i_1, u_j2 = u_m2*i_2, u_j3 = u_m3*i_3, u_j4 = u_m4*i_4, u_j5 = u_m5*i_5, u_j6 = u_m6*i_6

' ***********************************************************************
' * 关节轴设置
' ***********************************************************************
'''''''''''''''''''''实际轴设置'''''''''''''''''''''
'选择关节轴号 0、1、2、3、4、5
BASE(0,1,2,3,4,5)
'轴类型设为脉冲轴，仿真设定为虚拟轴
atype=0,0,0,0,0,0
'把 units 设成 1deg 对应的脉冲数
UNITS = u_j1/360,u_j2/360,u_j3/360,u_j4/360,u_j5/360 ,u_j6/360
'设置关节轴的位置，此处要根据实际情况
DPOS=0,0,0,0,0,0
'速度参数设置，速度、加速度、减速度
speed=100,100,100,100,100,100
accel=1000,1000,1000,1000,1000,1000
decel=1000,1000,1000,1000,1000,1000
'使用关节轴的速度和加速度限制
CLUTCH_RATE=0,0,0,0,0,0
'''''''''''''''''''''设置启动拐角减速'''''''''''''''''''''
'开启连续插补
merge=on
'启动拐角减速
corner_mode = 2
'开始减速的角度 15 度
decel_angle = 15 * (PI/180)
'降到最低速度的角度 45 度
stop_angle = 45 * (PI/180)
' 加减速过程S曲线持续时间
SRAMP = 200

'''''''''''''''''''''虚拟轴设置'''''''''''''''''''''
' 工具轴轴号
BASE(6,7,8,9,10,11)
ATYPE=0,0,0,0,0,0
' 运动精度，要提前设置，中途不能变化
UNITS=1000,1000,1000,1000,1000,1000
speed=100,100,100,100,100,100

' 工具虚拟轴
BASE(20,21,22,23,24,25)
ATYPE=0,0,0,0,0,0
UNITS=1000,1000,1000,1000,1000,1000

BASE(15)
ATYPE = 0
DPOS = 0

BASE(26,27,28,29,30,31)
ATYPE=0,0,0,0,0,0
UNITS=1000,1000,1000,1000,1000,1000

'''''''''''''''''''''建立机械手连接'''''''''''''''''''''
' 机器人几何参数的 Table 列表，根据手册说明填写参数
TABLE(0,LargeZ,L1,L2,L3,L4,D5,u_j1,u_j2,u_j3,u_j4,u_j5,u_j6,PulesVROneCircle,SmalLX,SmalLY,SmalLZ,InitRx,InitRy,InitRz)
' 默认关节模式，将关节轴链接到末端虚拟轴
BASE(6,7,8,9,10,11)
CONNREFRAME(6,0,0,1,2,3,4,5)
'BASE(6,7,8,9,10,11)
'CONNREFRAME(6,0,0,1,2,3,4,5)
'BASE(0, 1, 2, 3, 4, 5)
'CONNREFRAME(6,0,26,27,28,29,30,31)
